In [2]:
import pandas as pd

In [13]:
df = pd.DataFrame({"No.":[1,2,3,4,5,6,7,8,9],"Jan":[12,45,23,42,43,23,76,36,87],"Fab":[50,28,34,43,23,76,35,24,65], "Mar":[12,41,23,49,43,22,76,36,87],"April":[50,28,34,43,13,76,35,64,65]})

In [14]:
df.head()

   No.  Jan  Fab  Mar  April
0    1   12   50   12     50
1    2   45   28   41     28
2    3   23   34   23     34
3    4   42   43   49     43
4    5   43   23   43     13

In [15]:
df["Jan"].mean()

43.0

> If you want to get mean or perform any other operation vertically :

In [16]:
df.apply("mean",axis=0)  #axis=0 is default

No.       5.000000
Jan      43.000000
Fab      42.000000
Mar      43.222222
April    45.333333
dtype: float64

> If you want to get mean or perform any other operation Horizontally :

In [19]:
df.apply("max",axis=1)  #axis=1 to perform horizontally

0    50
1    45
2    34
3    49
4    43
5    76
6    76
7    64
8    87
dtype: int64

In [22]:
df.groupby("No.")[["Jan","Fab"]].mean()

      Jan   Fab
No.
1    12.0  50.0
2    45.0  28.0
3    23.0  34.0
4    42.0  43.0
5    43.0  23.0
6    23.0  76.0
7    76.0  35.0
8    36.0  24.0
9    87.0  65.0

> If I want to remark the January monthly sales of every store, then I'll add a new column using numpy.

In [23]:
import numpy as np
dfWithRemarks=np.where(df["Jan"]>=30,"Good","Not Good")

In [26]:
dfWithRemarks

array(['Not Good', 'Good', 'Not Good', 'Good', 'Good', 'Not Good', 'Good',
       'Good', 'Good'], dtype='<U8')

In [27]:
df

   No.  Jan  Fab  Mar  April
0    1   12   50   12     50
1    2   45   28   41     28
2    3   23   34   23     34
3    4   42   43   49     43
4    5   43   23   43     13
5    6   23   76   22     76
6    7   76   35   76     35
7    8   36   24   36     64
8    9   87   65   87     65

In [28]:
df["Jan Remarks"]=dfWithRemarks

In [29]:
df

   No.  Jan  Fab  Mar  April Jan Remarks
0    1   12   50   12     50    Not Good
1    2   45   28   41     28        Good
2    3   23   34   23     34    Not Good
3    4   42   43   49     43        Good
4    5   43   23   43     13        Good
5    6   23   76   22     76    Not Good
6    7   76   35   76     35        Good
7    8   36   24   36     64        Good
8    9   87   65   87     65        Good

> Concatenate two dataframes

In [34]:
newDf=pd.concat([df,df],axis=1) # axis =1 will add df horizontally

In [35]:
newDf

,No.,Jan,Fab,Mar,April,Jan Remarks,No.,Jan,Fab,Mar,April,Jan Remarks
0,1,12,50,12,50,Not Good,1,12,50,12,50,Not Good
1,2,45,28,41,28,Good,2,45,28,41,28,Good
2,3,23,34,23,34,Not Good,3,23,34,23,34,Not Good
3,4,42,43,49,43,Good,4,42,43,49,43,Good
4,5,43,23,43,13,Good,5,43,23,43,13,Good
5,6,23,76,22,76,Not Good,6,23,76,22,76,Not Good
6,7,76,35,76,35,Good,7,76,35,76,35,Good
7,8,36,24,36,64,Good,8,36,24,36,64,Good
8,9,87,65,87,65,Good,9,87,65,87,65,Good

> if you have to remove row from datafram which contains NaN value then,

In [ ]:
df.dropna()

> if you have to remove column from datafram which contains NaN value then,

In [ ]:
df.dropna(axis=1)

> you can just replace NaN value by-

In [ ]:
df.fillna(0)